In [2]:
import pandas as pd
import numpy as np

In [3]:
students = "students_complete.csv"

In [4]:
studentsdf = pd.read_csv(students)
studentsdf.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
schools = "schools_complete.csv"

In [6]:
schoolsdf = pd.read_csv(schools)
schoolsdf

    School ID                   name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [7]:
schoolsdf["type"].unique

<bound method Series.unique of 0     District
1     District
2      Charter
3     District
4      Charter
5      Charter
6      Charter
7     District
8      Charter
9      Charter
10     Charter
11    District
12    District
13    District
14     Charter
Name: type, dtype: object>

In [8]:
district = schoolsdf.loc[schoolsdf["type"] == "District"]
district

    School ID                   name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
3           3  Hernandez High School  District  4635  3022020
7           7     Bailey High School  District  4976  3124928
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916

In [9]:
schoolcount = district["type"].value_counts()
schoolcount

District    7
Name: type, dtype: int64

In [10]:
schoolcountnum = pd.to_numeric(schoolcount)

In [11]:
studentcount = district["size"].sum()
studentcount

26976

In [12]:
budget = district["budget"].sum()
budget

17347923

In [13]:
ams = studentsdf["math_score"].mean()
ams

78.98537145774827

In [14]:
ars = studentsdf["reading_score"].mean()
ars

81.87784018381414

In [15]:
perpassmath = studentsdf.loc[studentsdf["math_score"] > 70, :]
ppmt = perpassmath["math_score"].count()
ppmt

28356

In [16]:
total = studentsdf["math_score"].count()
total

39170

In [17]:
ppm = ppmt / total
ppm

0.7239213683941792

In [18]:
perpassread = studentsdf.loc[studentsdf["reading_score"] > 70, :]
ppr = perpassread["reading_score"].count()
ppr

32500

In [19]:
pprt = ppr / total
pprt

0.8297166198621394

In [20]:
totalpass = studentsdf.loc[(studentsdf["reading_score"] > 70) & 
                           (studentsdf["math_score"] > 70), :]
tp = totalpass["name"].count()

tp

23816

In [21]:
overall = (ppm + pprt) / 2
overall

0.77681899412815936

In [22]:
summary = pd.DataFrame({"Total Schools":schoolcountnum, 
                       "Total Students": studentcount,
                       "Total Budget": budget,
                       "Average Math Score": ams,
                       "Average Reading Score": ars,
                       "% Passing Math": ppm,
                       "% Passing Reading": pprt,
                       "% Overall Passing Rate": overall}
                        )
summary

,% Overall Passing Rate,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Total Budget,Total Schools,Total Students
District,0.776819,0.723921,0.829717,78.985371,81.87784,17347923,7,26976

In [23]:
#format the table
# summary["Total Students"] = summary["Total Students].map("{:,}".format)

In [24]:
name= schoolsdf["name"]
name

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
Name: name, dtype: object

In [25]:
stype = schoolsdf["type"]
stype

0     District
1     District
2      Charter
3     District
4      Charter
5      Charter
6      Charter
7     District
8      Charter
9      Charter
10     Charter
11    District
12    District
13    District
14     Charter
Name: type, dtype: object

In [26]:
#schoolsdf["budget"] = schoolsdf["budget"].map("$ {:,}".format)

In [27]:
sbudget = schoolsdf["budget"]

In [28]:
#schoolsdf["size"] = schoolsdf["size"].map("{:,}".format)

In [29]:
stupop = schoolsdf["size"]
stupop.head()

0    2917
1    2949
2    1761
3    4635
4    1468
Name: size, dtype: int64

In [30]:
sbudgetnum = pd.to_numeric(sbudget)
stupopnum = pd.to_numeric(stupop)

In [31]:
perstubu = sbudgetnum / stupopnum
perstubu

0     655.0
1     639.0
2     600.0
3     652.0
4     625.0
5     578.0
6     582.0
7     628.0
8     581.0
9     609.0
10    583.0
11    637.0
12    650.0
13    644.0
14    638.0
dtype: float64

In [32]:
perstubu = perstubu.map("$ {:,.2f}".format)

In [33]:
avgmath = studentsdf.groupby(["school"])
aa = avgmath.mean()

#create a new data frame with these variables
#clean up the headers
#merge with the data frame below

In [37]:
mavgschool = studentsdf.groupby(["school"])
mavgschool.mean()

                       Student ID  reading_score  math_score
school
Bailey High School        20358.5      81.033963   77.048432
Cabrera High School       16941.5      83.975780   83.061895
Figueroa High School       4391.0      81.158020   76.711767
Ford High School          36165.0      80.746258   77.102592
Griffin High School       12995.5      83.816757   83.351499
Hernandez High School      9944.0      80.934412   77.289752
Holden High School        23060.0      83.814988   83.803279
Huang High School          1458.0      81.182722   76.629414
Johnson High School       32415.0      80.966394   77.072464
Pena High School          23754.5      84.044699   83.839917
Rodriguez High School     28035.0      80.744686   76.842711
Shelton High School        6746.0      83.725724   83.359455
Thomas High School        38352.0      83.848930   83.418349
Wilson High School        14871.0      83.989488   83.274201
Wright High School        25135.5      83.955000   83.682222

In [66]:
ppmt1 = mavgschool.loc[studentsdf["reading_score"] > 70, :]
ppr1 = ppmt1["reading_score"].count()
ppr1.head()

AttributeError: Cannot access callable attribute 'loc' of 'DataFrameGroupBy' objects, try using the 'apply' method

In [62]:
schoolsdfa = pd.DataFrame(mavgschool.mean())
schoolsdfa.head()

                      Student ID  reading_score  math_score
school
Bailey High School       20358.5      81.033963   77.048432
Cabrera High School      16941.5      83.975780   83.061895
Figueroa High School      4391.0      81.158020   76.711767
Ford High School         36165.0      80.746258   77.102592
Griffin High School      12995.5      83.816757   83.351499

In [63]:
del schoolsdfa["Student ID"]

In [67]:
rename = schoolsdfa.rename(columns={"school" : "Name", 
                                    "reading_score" : "Average Reading Score ",
                                    "math_score" : "Average Math Score"}
                                    
                                    )

In [69]:
rename.head()

                      Average Reading Score   Average Math Score
school
Bailey High School                 81.033963           77.048432
Cabrera High School                83.975780           83.061895
Figueroa High School               81.158020           76.711767
Ford High School                   80.746258           77.102592
Griffin High School                83.816757           83.351499

In [41]:
schoolsum = pd.DataFrame({"Name": name,
                          "Type": stype,
                          "Total School Budget": sbudget,
                          "Total Students": stupop,
                          "Per Student Budget": perstubu,
                          
                          
                          
                         }
                        )
schoolsum

,Name,Per Student Budget,Total School Budget,Total Students,Type
0,Huang High School,$ 655.00,1910635,2917,District
1,Figueroa High School,$ 639.00,1884411,2949,District
2,Shelton High School,$ 600.00,1056600,1761,Charter
3,Hernandez High School,$ 652.00,3022020,4635,District
4,Griffin High School,$ 625.00,917500,1468,Charter
5,Wilson High School,$ 578.00,1319574,2283,Charter
6,Cabrera High School,$ 582.00,1081356,1858,Charter
7,Bailey High School,$ 628.00,3124928,4976,District
8,Holden High School,$ 581.00,248087,427,Charter
9,Pena High School,$ 609.00,585858,962,Charter
10,Wright High School,$ 583.00,1049400,1800,Charter
11,Rodriguez High School,$ 637.00,2547363,3999,District
12,Johnson High School,$ 650.00,3094650,4761,District
13,Ford High School,$ 644.00,1763916,2739,District
14,Thomas High School,$ 638.00,1043130,1635,Charter

In [70]:
renameschoolsum = schoolsum.rename(columns={"Name" : "school"})
renameschoolsum.head()

,school,Per Student Budget,Total School Budget,Total Students,Type
0,Huang High School,$ 655.00,1910635,2917,District
1,Figueroa High School,$ 639.00,1884411,2949,District
2,Shelton High School,$ 600.00,1056600,1761,Charter
3,Hernandez High School,$ 652.00,3022020,4635,District
4,Griffin High School,$ 625.00,917500,1468,Charter

In [73]:
schoolindex = renameschoolsum.set_index("school")
schoolindex.head()

,Per Student Budget,Total School Budget,Total Students,Type
school,,,,
Huang High School,$ 655.00,1910635,2917,District
Figueroa High School,$ 639.00,1884411,2949,District
Shelton High School,$ 600.00,1056600,1761,Charter
Hernandez High School,$ 652.00,3022020,4635,District
Griffin High School,$ 625.00,917500,1468,Charter

In [77]:
schoolindex.join(rename, how='outer')

,Per Student Budget,Total School Budget,Total Students,Type,Average Reading Score,Average Math Score
school,,,,,,
Bailey High School,$ 628.00,3124928,4976,District,81.033963,77.048432
Cabrera High School,$ 582.00,1081356,1858,Charter,83.975780,83.061895
Figueroa High School,$ 639.00,1884411,2949,District,81.158020,76.711767
Ford High School,$ 644.00,1763916,2739,District,80.746258,77.102592
Griffin High School,$ 625.00,917500,1468,Charter,83.816757,83.351499
Hernandez High School,$ 652.00,3022020,4635,District,80.934412,77.289752
Holden High School,$ 581.00,248087,427,Charter,83.814988,83.803279
Huang High School,$ 655.00,1910635,2917,District,81.182722,76.629414
Johnson High School,$ 650.00,3094650,4761,District,80.966394,77.072464
Pena High School,$ 609.00,585858,962,Charter,84.044699,83.839917
Rodriguez High School,$ 637.00,2547363,3999,District,80.744686,76.842711
Shelton High School,$ 600.00,1056600,1761,Charter,83.725724,83.359455
Thomas High School,$ 638.00,1043130,1635,Charter,83.848930,83.418349
Wilson High School,$ 578.00,1319574,2283,Charter,83.989488,83.274201
Wright High School,$ 583.00,1049400,1800,Charter,83.955000,83.682222